[{"location": "Chengannur", "latitude": 9.291278049999999, "longitude": 76.5938331028111, "commentary": "On 16 August 2018, severe floods affected the south Indian state Kerala, in a location called Chengannur. The source of the news is https://en.wikipedia.org/wiki/2018_Kerala_floods."}, {"location": "Pandanad", "latitude": 9.3271841, "longitude": 76.5777127, "commentary": "The latest news about the disasters in Pandanad was reported on March 11th and is available from the 'roundtable on 3.11' source at https://www.3-11.org/."}, {"location": "Edanad", "latitude": 9.3343624, "longitude": 76.63533314837971, "commentary": "The latest news about disasters in Edanad is from Edanad Breaking News, dated August 2018, with a source of https://docs.goog. The overall accuracy for the news source has been observed as 94.1%."}, {"location": "Aranmula", "latitude": 9.32681, "longitude": 76.6856956, "commentary": "The latest news about the disaster in Aranmula is about Chennai-based KGS Group having the potential to devastate the ecology and livelihood of inhabitants, as reported on June 16th, 2020. The source of information can be found here: https://www.thenewsminute.com/article/chennithala-youth-missing-after-boat-carrying-14-capsizes-aranmula-pampa-122671."}, {"location": "Kozhencherry", "latitude": 9.3369731, "longitude": 76.7064286, "commentary": "The latest news about the disaster in Kozhencherry is from 16 August 2018, affecting the south Indian state of Kerala, with a source of information being provided in the link https://www.thehindu.com/news/national/kerala/kerala-floods-26-more-die-pm-modi-announces-rs-500-crore-relief/article24742742.ece."}, {"location": "Ayiroor", "latitude": 9.372094400000002, "longitude": 76.73539612778981, "commentary": "On 16 August 2018, severe floods affected the south Indian state Kerala due to unusually high rainfall during the monsoon season. It was the worst flood in Kerala in almost a century, according to the Times of India. The source of the news can be found at https://timesofindia.indiatimes.com/city/kochi/kerala-floods-worst-in-almost-a-century/articleshow/65451376.cms."}, {"location": "Ranni", "latitude": 9.3852605, "longitude": 76.7848789, "commentary": "The latest news about disasters in Ranni is that, in August, the town was fully decimated. The source of the news is Onmanorama."}, {"location": "Pandalam", "latitude": 9.2251208, "longitude": 76.6781249, "commentary": "The latest news about the disasters in Pandalam is 'On 16 August 2018, severe floods affected the south Indian state Kerala, due to unusually high rainfall during the monsoon season. It was the worst flood in ...' and the source link is 'https://en.wikipedia.org/wiki/2018_Kerala_floods'"}, {"location": "Kuttanad", "latitude": 9.4507458, "longitude": 76.43081811505664, "commentary": "The latest news about the disasters in Kuttanad is that the sudden release of the large quantities of water from all the dams, compounded by heavy rainfall, resulted in a sudden rise in water level affecting almost the entire state, especially the low-lying areas of Kuttanad. The date of the news is not available but the location of the disaster is Kuttanad and the source of the news can be found here:  https://www.thehindu.com/news/national/kerala/kuttanad-residents-lament-as-floods-linger-on/article29078789.ece"}, {"location": "Malappuram", "latitude": 11.0428925, "longitude": 76.0807838, "commentary": "At least 22 people were killed on Friday when a double-decker boat overturned and sank near a beach in Kerala's Malappuram district. The source of this news is from New Delhi."}, {"location": "Aluva", "latitude": 10.17039815, "longitude": 76.38839448844891, "commentary": "The latest news about disasters in Aluva includes a massive floods in Aluva and nearby regions on Sunday, leaving thousands homeless and causing significant destruction. The source of this information can be found in the news links provided earlier."}]